Exploring some more pandas functionality
-----------------------------------------

* apply()

In [1]:
import pandas as pd

df =pd.DataFrame({'x' :[1,2,-1],'y':[-2,6,4],'z':[1,2,3]})
df

   x  y  z
0  1 -2  1
1  2  6  2
2 -1  4  3

In [2]:
# understanding lambda function
increment = lambda a: a+1
print(increment(10))
print(increment(15))

simple_interest = lambda p,t,r:p*t*r/100
print(simple_interest(1000,2,20))
print(simple_interest(2000,2,20))

11
16
400.0
800.0

In [3]:
df['x_squared'] = df['x'].apply(lambda a:a**2)
df

   x  y  z  x_squared
0  1 -2  1          1
1  2  6  2          4
2 -1  4  3          1

In [8]:
df

   x  y  z  x_squared
0  1 -2  1          1
1  2  6  2          4
2 -1  4  3          1

In [10]:
def parity_str(x):
    if x%2 ==0:
        return 'even'
    return 'odd'

df['x_parity'] = df['x'].apply(parity_str)
df

   x  y  z  x_squared x_parity
0  1 -2  1          1      odd
1  2  6  2          4     even
2 -1  4  3          1      odd

In [21]:
df['x_parity'].value_counts()

odd     2
even    1
Name: x_parity, dtype: int64

In [16]:
pd.get_dummies(df['x_parity'])

   even  odd
0     0    1
1     1    0
2     0    1

In [12]:
students_df = pd.read_csv('data/studentsdataset.csv')
students_df

      name  gender  class  gpa  num_classes
0   Jyothi  female  Btech   90            3
1    Mohit    male  Mtech   93            1
2     Naga    male  Btech   85            3
3    Navya  female  Mtech   87            2
4     Ramu    male  Mtech   95            3
5    Satya    male  Btech   92            2
6  Shivani  female    Bsc   97            3
7    umend    male  Btech   81            2
8   vamshi    male  Btech   85            2
9       vv    male  Btech   82            2

In [23]:
def gender_flag(x):
    if x == 'female':
        return True
    return False

students_df['female_flag'] = students_df['gender'].apply(lambda g:g=='female')
students_df

      name  gender  class  gpa  num_classes  female_flag
0   Jyothi  female  Btech   90            3         True
1    Mohit    male  Mtech   93            1        False
2     Naga    male  Btech   85            3        False
3    Navya  female  Mtech   87            2         True
4     Ramu    male  Mtech   95            3        False
5    Satya    male  Btech   92            2        False
6  Shivani  female    Bsc   97            3         True
7    umend    male  Btech   81            2        False
8   vamshi    male  Btech   85            2        False
9       vv    male  Btech   82            2        False

In [24]:
pd.get_dummies(students_df['female_flag'])

   False  True
0      0      1
1      1      0
2      1      0
3      0      1
4      1      0
5      1      0
6      0      1
7      1      0
8      1      0
9      1      0

In [25]:
students_df['gender'].value_counts()

male      7
female    3
Name: gender, dtype: int64

In [26]:
gender_group = students_df.groupby('female_flag')
gender_group

In [27]:
gender_group['gpa']

In [30]:
gender_group['gpa'].mean()

female_flag
False    87.571429
True     91.333333
Name: gpa, dtype: float64

In [31]:
gender_group['gpa'].median()

female_flag
False    85
True     90
Name: gpa, dtype: int64

In [32]:
class_group = students_df.groupby('class')
class_group['gpa'].mean()

class
Bsc      97.000000
Btech    85.833333
Mtech    91.666667
Name: gpa, dtype: float64